---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.CurrencyPerBritishThermalUnitPerHour
source: html/07c9c8a5-4e67-bf8b-e529-f0e55b2c6fd4.htm
---
# Autodesk.Revit.DB.UnitTypeId.CurrencyPerBritishThermalUnitPerHour Property

Cost per British thermal unit per hour.

## Syntax (C#)
```csharp
public static ForgeTypeId CurrencyPerBritishThermalUnitPerHour { get; }
```